{"class_name": "Functional", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 299, 299, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1_conv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1_conv1_bn", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1_conv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block1_conv1_act", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1_conv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1_conv2_bn", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1_conv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block1_conv2_act", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block2_sepconv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block2_sepconv1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2_sepconv1_bn", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block2_sepconv2_act", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block2_sepconv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block2_sepconv2", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2_sepconv2_bn", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_24", "trainable": true, "dtype": "float32"}, "name": "add_24", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block3_sepconv1_act", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block3_sepconv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block3_sepconv1", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3_sepconv1_bn", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block3_sepconv2_act", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block3_sepconv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block3_sepconv2", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3_sepconv2_bn", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_25", "trainable": true, "dtype": "float32"}, "name": "add_25", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block4_sepconv1_act", "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block4_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block4_sepconv1", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4_sepconv1_bn", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block4_sepconv2_act", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block4_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block4_sepconv2", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4_sepconv2_bn", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [1, 1], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_26", "trainable": true, "dtype": "float32"}, "name": "add_26", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block5_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block5_sepconv1_act", "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block5_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block5_sepconv1", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5_sepconv1_bn", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block5_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block5_sepconv2_act", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block5_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block5_sepconv2", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5_sepconv2_bn", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block5_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block5_sepconv3_act", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block5_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block5_sepconv3", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5_sepconv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5_sepconv3_bn", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_27", "trainable": true, "dtype": "float32"}, "name": "add_27", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block6_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block6_sepconv1_act", "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block6_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block6_sepconv1", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block6_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block6_sepconv1_bn", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block6_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block6_sepconv2_act", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block6_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block6_sepconv2", "inbound_nodes": [[["block6_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block6_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block6_sepconv2_bn", "inbound_nodes": [[["block6_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block6_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block6_sepconv3_act", "inbound_nodes": [[["block6_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block6_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block6_sepconv3", "inbound_nodes": [[["block6_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block6_sepconv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block6_sepconv3_bn", "inbound_nodes": [[["block6_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_28", "trainable": true, "dtype": "float32"}, "name": "add_28", "inbound_nodes": [[["block6_sepconv3_bn", 0, 0, {}], ["add_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block7_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block7_sepconv1_act", "inbound_nodes": [[["add_28", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block7_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block7_sepconv1", "inbound_nodes": [[["block7_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block7_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block7_sepconv1_bn", "inbound_nodes": [[["block7_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block7_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block7_sepconv2_act", "inbound_nodes": [[["block7_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block7_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block7_sepconv2", "inbound_nodes": [[["block7_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block7_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block7_sepconv2_bn", "inbound_nodes": [[["block7_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block7_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block7_sepconv3_act", "inbound_nodes": [[["block7_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block7_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block7_sepconv3", "inbound_nodes": [[["block7_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block7_sepconv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block7_sepconv3_bn", "inbound_nodes": [[["block7_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_29", "trainable": true, "dtype": "float32"}, "name": "add_29", "inbound_nodes": [[["block7_sepconv3_bn", 0, 0, {}], ["add_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block8_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block8_sepconv1_act", "inbound_nodes": [[["add_29", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block8_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block8_sepconv1", "inbound_nodes": [[["block8_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block8_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block8_sepconv1_bn", "inbound_nodes": [[["block8_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block8_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block8_sepconv2_act", "inbound_nodes": [[["block8_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block8_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block8_sepconv2", "inbound_nodes": [[["block8_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block8_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block8_sepconv2_bn", "inbound_nodes": [[["block8_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block8_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block8_sepconv3_act", "inbound_nodes": [[["block8_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block8_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block8_sepconv3", "inbound_nodes": [[["block8_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block8_sepconv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block8_sepconv3_bn", "inbound_nodes": [[["block8_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_30", "trainable": true, "dtype": "float32"}, "name": "add_30", "inbound_nodes": [[["block8_sepconv3_bn", 0, 0, {}], ["add_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block9_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block9_sepconv1_act", "inbound_nodes": [[["add_30", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block9_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block9_sepconv1", "inbound_nodes": [[["block9_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block9_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block9_sepconv1_bn", "inbound_nodes": [[["block9_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block9_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block9_sepconv2_act", "inbound_nodes": [[["block9_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block9_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block9_sepconv2", "inbound_nodes": [[["block9_sepconv2_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block9_sepconv2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block9_sepconv2_bn", "inbound_nodes": [[["block9_sepconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block9_sepconv3_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block9_sepconv3_act", "inbound_nodes": [[["block9_sepconv2_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block9_sepconv3", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block9_sepconv3", "inbound_nodes": [[["block9_sepconv3_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block9_sepconv3_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block9_sepconv3_bn", "inbound_nodes": [[["block9_sepconv3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_31", "trainable": true, "dtype": "float32"}, "name": "add_31", "inbound_nodes": [[["block9_sepconv3_bn", 0, 0, {}], ["add_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block10_sepconv1_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block10_sepconv1_act", "inbound_nodes": [[["add_31", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block10_sepconv1", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "block10_sepconv1", "inbound_nodes": [[["block10_sepconv1_act", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block10_sepconv1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block10_sepconv1_bn", "inbound_nodes": [[["block10_sepconv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block10_sepconv2_act", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block10_sepconv2_act", "inbound_nodes": [[["block10_sepconv1_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "block10_sepconv2", "trainable": true, "dtype": "float32", "filters": 728, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, 